org/OrgMode/2016-03-18-orgmode-table-formulas.org
#+OPTIONS: num:nil
#+OPTIONS: ^:nil
#+OPTIONS: H:nil
#+OPTIONS: toc:nil
#+AUTHOR: Zhengchao Xu
#+EMAIL: xuzhengchaojob@gmail.com

#+BEGIN_HTML
---
layout: post
title: OrgMode常用表格处理公式
categories: [OrgMode]
---
#+END_HTML

#+NAME: tbl1
|  1 | 1 |  5 |  3 |  2 |
|----+---+----+----+----|
|  1 | 3 |  1 | 12 | 17 |
| 10 | 3 | 19 | 49 | 81 |
|  1 | 3 |  5 | 16 | 25 |
|  3 | 9 | 12 | 45 | 69 |
#+TBLFM: $5='(apply '+ '($1..$4));N
#+TBLFM: $5=vsum($1..$4)
#+NAME: tbl2
| "sdfadf" | 0 |  0 |   0 | 2 |
|----------+---+----+-----+---|
|        1 | 1 | 11 |   0 | 1 |
|        1 | 1 |  1 | sdL | 1 |
|        1 | 1 |  1 |   0 | 1 |
#+TBLFM: @3$4='(concat (substring @1$1 1 3) "L")

|         |        |      |          |
|---------+--------+------+----------|
|    1:00 |   2:23 | 3:33 | 06:56:00 |
| 3:01:20 | 2:11:2 | -9:2 |    -3.83 |
|         |        |      |          |
#+TBLFM: @2$4=$1+$2+$3;T::@3$4=$1+$2+$3;t

* 单一表项的使用
1. 列使用 *$N* 表示, 或相对位置 *$-/+N*. $< 第一行, $> 最后一行. $0, 当前列.
2. 行使用 *@*. 
3. 公式中使用相对位置. 该相对位置一般是指要求结果的表格的相对位置.
   例如下面的公式, 就是将 @2$4 这个表格的 "上一行左移3个" 位置的表格中的
   值加上4.
   #+BEGIN_EXAMPLE
   #+TBLFM: @2$4=@-1$-3+4
   #+END_EXAMPLE
* 范围的使用
使用两个 dot 即 *..* 来表示范围, 例如 
1. $1..$3. 表示当前行的前三个元素.
2. @2$1..@4$3, 表示一块6个表格的正方形区域

* 使用其他表项或其他文件中的表
1. 使用remote(file, ref)
2. 其他表必须可以被引用, 例如可以用 "#+NAME" 修饰. file也可以是一个
   表格项, 该项的内容必须是另外一个表格的合法引用.
3. ref是指远程表格的一个合法表项.

* 常用公式
1. *使用Lisp代码需要前面加上'* 
2. 两列相加: $X = $M + $N. 或者 Lisp代码 '(+ $M $N);N'
   也可以
   需要说明的是: 如果第一行是表头, (即第二行是 ---- ), 第一行不会相加.
   例如下面的例子. 但是行相加会作用在第一行上.
   #+NAME: tbl1
|  9 | 1 |  2 | 0 | 2 |
|----+---+----+---+---|
|  1 | 3 |  4 | 0 | 1 |
| 10 | 3 | 13 | 0 | 3 |
|  1 | 3 |  4 | 0 | 1 |
|----+---+----+---+---|
|  3 | 9 | 12 |   |   |
#+TBLFM: $3=$1+$2
3. 多列相加: vsum($M..$N). 或者 '(apply '+ '($M..$N));N
4. 时间计算, 时间格式必须为 HH:MM[:SS], 后面接 *T* 则结果会同样
   显示为时间, 接 *t* 则会表示为小数, 例如
|    1:00 |   2:23 | 3:33 | 06:56:00 |
| 3:01:20 | 2:11:2 | -9:2 |    -3.83 |
|         |        |      |          |
#+TBLFM: @2$4=$1+$2+$3;T::@3$4=$1+$2+$3;t
