_posts/OrgMode/2016-03-18-orgmode-table-formulas.html
---
layout: post
title: OrgMode常用表格处理公式
categories: [OrgMode]
---

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">单一表项的使用</h2>
<div class="outline-text-2" id="text-orgheadline1">
<ol class="org-ol">
<li>列使用 <b>$N</b> 表示, 或相对位置 <b>$-/+N</b>. $&lt; 第一行, $&gt; 最后一行. $0, 当前列.</li>
<li>行使用 <b>@</b>.</li>
<li><p>
公式中使用相对位置. 该相对位置一般是指要求结果的表格的相对位置.
例如下面的公式, 就是将 @2$4 这个表格的 "上一行左移3个" 位置的表格中的
值加上4.
</p>
<pre class="example">
#+TBLFM: @2$4=@-1$-3+4
</pre></li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2">范围的使用</h2>
<div class="outline-text-2" id="text-orgheadline2">
<p>
使用两个 dot 即 <b>..</b> 来表示范围, 例如 
</p>
<ol class="org-ol">
<li>$1..$3. 表示当前行的前三个元素.</li>
<li>@2$1..@4$3, 表示一块6个表格的正方形区域</li>
</ol>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3">使用其他表项或其他文件中的表</h2>
<div class="outline-text-2" id="text-orgheadline3">
<ol class="org-ol">
<li>使用remote(file, ref)</li>
<li>其他表必须可以被引用, 例如可以用 "#+NAME" 修饰. file也可以是一个
表格项, 该项的内容必须是另外一个表格的合法引用.</li>
<li>ref是指远程表格的一个合法表项.</li>
</ol>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4">常用公式</h2>
<div class="outline-text-2" id="text-orgheadline4">
<ol class="org-ol">
<li>使用Lisp代码需要前面加上'</li>
<li><p>
两列相加: $X = $M + $N. 或者 Lisp代码 '(+ $M $N);N'
也可以
需要说明的是: 如果第一行是表头, (即第二行是 -&#x2014; ), 第一行不会相加.
例如下面的例子. 但是行相加会作用在第一行上.
</p>
<pre class="example">
   #+NAME: tbl1
|  9 | 1 |  2 | 0 | 2 |
|----+---+----+---+---|
|  1 | 3 |  4 | 0 | 1 |
| 10 | 3 | 13 | 0 | 3 |
|  1 | 3 |  4 | 0 | 1 |
|----+---+----+---+---|
|  3 | 9 | 12 |   |   |
#+TBLFM: $3=$1+$2
</pre></li>
<li>多列相加: vsum($M..$N). 或者 '(apply '+ '($M..$N));N</li>
<li><p>
时间计算, 时间格式必须为 HH:MM[:SS], 后面接 <b>T</b> 则结果会同样
显示为时间, 接 <b>t</b> 则会表示为小数, 例如
</p>
<pre class="example">
|         |        |      |          |
|---------+--------+------+----------|
|    1:00 |   2:23 | 3:33 | 06:56:00 |
| 3:01:20 | 2:11:2 | -9:2 |    -3.83 |
#+TBLFM: @2$4=$1+$2+$3;T::@3$4=$1+$2+$3;t
</pre></li>
</ol>
</div>
</div>
